; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-91)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b22)
    (on b22 b8)
    (on-table b8)
    (clear b13)
    (on b13 b27)
    (on b27 b7)
    (on b7 b5)
    (on b5 b2)
    (on b2 b17)
    (on b17 b18)
    (on b18 b3)
    (on b3 b15)
    (on b15 b14)
    (on b14 b25)
    (on-table b25)
    (clear b19)
    (on b19 b9)
    (on b9 b16)
    (on b16 b20)
    (on-table b20)
    (clear b11)
    (on b11 b26)
    (on b26 b1)
    (on b1 b24)
    (on b24 b12)
    (on b12 b4)
    (on b4 b10)
    (on b10 b6)
    (on b6 b21)
    (on b21 b23)
    (on-table b23))
 (:goal (and 
(on-table b20)
(clear b13) (on b13 b1)
))
)

; plan
1. (unstack b11 b26)
   deleted: (on b11 b26) (clear b11) (arm-empty)
   added: (holding b11) (clear b26)
   goals met: 2 of 3
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 3
3. (unstack b26 b1)
   deleted: (on b26 b1) (clear b26) (arm-empty)
   added: (holding b26) (clear b1)
   goals met: 2 of 3
4. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 3
5. (unstack b13 b27)
   deleted: (on b13 b27) (clear b13) (arm-empty)
   added: (holding b13) (clear b27)
   goals met: 1 of 3
6. (stack b13 b1)
   deleted: (clear b1) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b1)
   goals met: 3 of 3
